[
    {
        "begriff": "CLI",
        "kategorie": "User Interface Arten",
        "definition": "Command Line Interface ist eine Benutzerschnittstelle, bei der man über Textbefehle mit dem Computer interagiert. Statt auf Symbole zu klicken, gibt man Befehle ein und bekommt textbasierte Antworten. Die CLI ist besonders in der IT und für Entwickler wichtig, da sie oft präziser und schneller ist als eine grafische Oberfläche. Mit Befehlen kann man z.B. Dateien verschieben, Software installieren oder Prozesse steuern. Auch Linux-Server werden häufig über die CLI verwaltet, da sie Ressourcen spart und erfahrenen Nutzern die volle Kontrolle über das System gibt.",
        "zusammenfassung": "Die CLI ermöglicht es Nutzern, durch Textbefehle mit dem Computer zu kommunizieren und ist besonders bei Entwicklern beliebt, da sie präzise und ressourcenschonend ist."
    },
    {
        "begriff": "API",
        "kategorie": "Entwicklung",
        "definition": "API steht für Application Programming Interface und ist eine Schnittstelle, die es Programmen ermöglicht, miteinander zu kommunizieren und Informationen auszutauschen. APIs ermöglichen es z.B. einer Wetter-App, Daten von einem Server abzurufen, der aktuelle Wetterdaten bereitstellt, und diese in der App anzuzeigen. APIs sind in vielen Bereichen präsent: Social-Media-Apps verwenden sie, um Feeds zu aktualisieren, Online-Shops für Bestandsaktualisierungen und viele Webdienste nutzen APIs, um Funktionen anderer Anbieter nahtlos in ihre eigenen Anwendungen zu integrieren. APIs sorgen so für Flexibilität und machen Anwendungen erweiterbar.",
        "zusammenfassung": "APIs ermöglichen es Anwendungen, miteinander zu kommunizieren und Daten oder Funktionen bereitzustellen, was für viele Web- und App-Funktionen unerlässlich ist."
    },
    {
        "begriff": "DNS",
        "kategorie": "Netzwerktechnologie",
        "definition": "DNS steht für Domain Name System und funktioniert wie ein Adressbuch fürs Internet. Es wandelt Domainnamen, wie 'google.com', in die passende IP-Adresse um, die Computer verstehen, damit die Verbindung zur Webseite hergestellt werden kann. Ohne DNS müsste man sich komplizierte IP-Adressen merken, um Webseiten zu erreichen. Weltweit gibt es zahlreiche DNS-Server, die zusammenarbeiten und Anfragen von Nutzern effizient verarbeiten, sodass sie die gewünschten Seiten finden und aufrufen können.",
        "zusammenfassung": "DNS übersetzt benutzerfreundliche Domainnamen wie 'example.com' in IP-Adressen, die Computer verstehen, und ermöglicht so den Zugriff auf Webseiten."
    },
    {
        "begriff": "NAS",
        "kategorie": "Speicherlösungen",
        "definition": "NAS steht für Network Attached Storage und ist eine Speicherlösung, die über ein Netzwerk erreichbar ist, sodass mehrere Geräte gleichzeitig auf die gespeicherten Daten zugreifen können. NAS-Systeme sind besonders praktisch für den Einsatz zu Hause oder im Unternehmen, da sie eine zentrale und flexible Datensicherung und Freigabe ermöglichen. Sie eignen sich gut für die Speicherung und Verwaltung von Daten, die gemeinsam genutzt werden sollen, wie Fotos, Videos oder Dokumente, und bieten oft Funktionen für automatische Backups und den Fernzugriff.",
        "zusammenfassung": "NAS-Geräte dienen als zentraler Speicher, auf den mehrere Nutzer im Netzwerk gleichzeitig zugreifen können, was sie ideal für Datensicherung und Dateifreigabe macht."
    },
    {
        "begriff": "HTTP",
        "kategorie": "Netzwerkprotokolle",
        "definition": "HTTP steht für Hypertext Transfer Protocol und ist das grundlegende Protokoll, das regelt, wie Daten zwischen Webbrowsern und Servern ausgetauscht werden. Wenn man eine Webseite aufruft, sendet der Browser eine HTTP-Anfrage an den Server, und der Server antwortet mit den Daten der Webseite. HTTP ermöglicht so das Surfen im Internet und legt fest, wie Text, Bilder, Videos und andere Daten angezeigt und strukturiert werden. HTTPS ist eine sichere Variante von HTTP, die Verschlüsselung für den Schutz sensibler Daten wie Passwörter und Kreditkarteninformationen bietet.",
        "zusammenfassung": "HTTP regelt, wie Daten zwischen deinem Browser und Webseiten ausgetauscht werden, und bildet die Basis des Internetsurfens."
    },
    {
        "begriff": "GUI",
        "kategorie": "User Interface Arten",
        "definition": "GUI steht für Graphical User Interface und ist eine grafische Benutzeroberfläche, die die Bedienung von Computern und Anwendungen durch visuelle Elemente wie Symbole, Schaltflächen und Menüs erleichtert. Im Gegensatz zur textbasierten CLI ermöglicht die GUI Nutzern eine intuitivere Interaktion durch Klicken und Ziehen von grafischen Objekten auf dem Bildschirm. Die GUI ist weit verbreitet und wird in Betriebssystemen wie Windows, macOS und Linux sowie in Apps verwendet, um die Benutzerfreundlichkeit zu verbessern und den Zugang zu Funktionen und Informationen zu vereinfachen.",
        "zusammenfassung": "Die GUI macht die Bedienung von Programmen einfacher, indem sie grafische Elemente wie Buttons, Menüs und Fenster anstelle von Textbefehlen nutzt."
    },
    {
        "begriff": "Virus",
        "kategorie": "Hacking",
        "definition": "Ein Virus ist eine Art von schädlicher Software (auch Malware genannt), die entwickelt wurde, um sich in andere Programme oder Dateien einzufügen und sich so zu verbreiten. Genau wie ein biologischer Virus braucht ein Computer-Virus einen „Wirt“, also ein Programm oder eine Datei, an das er sich anhängt, um aktiv zu werden und Schaden anzurichten. Sobald der infizierte Wirt ausgeführt wird, kann sich der Virus auf andere Dateien und Computer im Netzwerk ausbreiten.",
        "zusammenfassung": "Ein Virus ist eine Schadsoftware, die sich an Programme oder Dateien anheftet und sich bei Ausführung verbreitet. Er kann Daten löschen, die Leistung des Computers beeinträchtigen oder sensible Informationen stehlen. Viren kommen häufig über E-Mails oder Downloads auf den Computer; Antivirensoftware und Vorsicht helfen, Infektionen zu vermeiden."
    },
    {
        "begriff": "Ransomware",
        "kategorie": "Hacking",
        "definition": "Ransomware ist eine Art Schadsoftware, die den Zugriff auf Daten oder Systeme blockiert und von den Opfern ein Lösegeld fordert, um den Zugriff wieder freizugeben. Sie verschlüsselt wichtige Dateien und macht sie so unbrauchbar, bis das Lösegeld bezahlt wird. Ransomware verbreitet sich oft über Phishing-E-Mails, infizierte Anhänge oder schadhafte Webseiten. Selbst nach Zahlung ist es nicht garantiert, dass die Daten wiederhergestellt werden. Um sich zu schützen, sollte man regelmäßig Backups machen und Antivirensoftware sowie sichere E-Mail- und Download-Gewohnheiten pflegen.",
        "zusammenfassung": "Ransomware ist eine Schadsoftware, die Dateien verschlüsselt und Lösegeld fordert, um sie wieder freizugeben. Sie verbreitet sich meist über Phishing-E-Mails oder schadhafte Webseiten. Schutz bieten Backups, Antivirensoftware und Vorsicht bei Anhängen und Downloads."
    },
    {
        "begriff": "Phishing",
        "kategorie": "Hacking",
        "definition": "Phishing ist eine Betrugsmethode, bei der Angreifer versuchen, sensible Daten wie Passwörter oder Bankdaten zu stehlen, indem sie sich als vertrauenswürdige Personen oder Unternehmen ausgeben. Meist geschieht dies über gefälschte E-Mails, SMS oder Webseiten, die täuschend echt aussehen. Das Opfer wird dazu verleitet, auf Links zu klicken oder persönliche Informationen einzugeben. Phishing kann zu Identitätsdiebstahl und finanziellem Schaden führen. Um sich zu schützen, sollte man immer skeptisch bei unerwarteten Nachrichten sein und keine vertraulichen Daten über unsichere Links preisgeben.",
        "zusammenfassung": "Phishing ist ein Betrug, bei dem Angreifer gefälschte E-Mails oder Webseiten nutzen, um sensible Daten wie Passwörter zu stehlen. Sie geben sich als vertrauenswürdige Quellen aus, um Opfer zur Preisgabe von Informationen zu verleiten. Vorsicht bei verdächtigen Nachrichten schützt vor Phishing."
    },
    {
        "begriff": "Wurm",
        "kategorie": "Hacking",
        "definition": "Ein Wurm ist eine Art Schadsoftware, die sich selbstständig und ohne menschliches Zutun verbreitet, meist über Netzwerke. Im Gegensatz zu einem Virus benötigt ein Wurm keinen „Wirt“, sondern vervielfältigt sich selbst und kann so ganze Netzwerke infizieren. Würmer verursachen oft Netzüberlastungen, da sie viele Kopien von sich selbst erzeugen. Manche Würmer können auch schädliche Nutzlasten tragen, die Daten löschen oder Sicherheitslücken ausnutzen. Schutz bieten Firewalls, Antivirensoftware und regelmäßige Updates.",
        "zusammenfassung": "Ein Wurm ist eine Schadsoftware, die sich selbstständig über Netzwerke verbreitet und kein Wirtsprogramm benötigt. Er kann Netzwerke überlasten und Schaden anrichten, indem er sich ständig vervielfältigt. Schutz bieten Firewalls, Antivirensoftware und regelmäßige Updates."
    },
    {
        "begriff": "Sicherheitslücke",
        "kategorie": "Hacking",
        "definition": "Eine Sicherheitslücke ist eine Schwachstelle in Software oder Hardware, die von Angreifern ausgenutzt werden kann, um unbefugt Zugriff zu erlangen oder Schaden anzurichten. Solche Lücken entstehen oft durch Programmierfehler oder veraltete Systeme ohne aktuelle Updates. Angreifer nutzen Sicherheitslücken, um Daten zu stehlen, Systeme zu stören oder Schadsoftware zu installieren. Besonders gefährdet sind Systeme, die keine regelmäßigen Updates erhalten. Sicherheitslücken lassen sich durch konsequente Updates, starke Passwörter und Sicherheitssoftware minimieren.",
        "zusammenfassung": "Eine Sicherheitslücke ist eine Schwachstelle in Software oder Hardware, die Angreifer für unbefugten Zugriff nutzen können. Oft entstehen sie durch veraltete Systeme oder Programmierfehler. Regelmäßige Updates und Sicherheitsmaßnahmen helfen, solche Lücken zu schließen."
    },
    {
        "begriff": "HTTPS",
        "kategorie": "Netzwerkprotokolle",
        "definition": "HTTPS (Hypertext Transfer Protocol Secure) ist eine sichere Version des HTTP-Protokolls und schützt die Datenübertragung zwischen Browser und Server durch Verschlüsselung. Diese Verschlüsselung verhindert, dass Dritte Daten abfangen oder manipulieren können, was besonders bei sensiblen Informationen wie Passwörtern und Zahlungsdaten wichtig ist. HTTPS wird durch SSL/TLS-Zertifikate ermöglicht, die den sicheren Austausch garantieren. Websites mit HTTPS sind für Nutzer vertrauenswürdiger und werden oft von Suchmaschinen bevorzugt. Um eine Website auf HTTPS umzustellen, muss ein SSL-Zertifikat installiert und aktiviert werden.",
        "zusammenfassung": "HTTPS ist eine sichere Version von HTTP, die Daten zwischen Browser und Server verschlüsselt und vor Fremdzugriff schützt. Es nutzt SSL/TLS-Zertifikate und ist besonders wichtig für den Schutz sensibler Daten wie Passwörter."
    },
    {
        "begriff": "Python",
        "kategorie": "Entwicklung",
        "definition": "Python ist eine vielseitige, einfach zu erlernende Programmiersprache, die für ihre klare Syntax und hohe Lesbarkeit bekannt ist. Sie eignet sich hervorragend für verschiedenste Anwendungen wie Webentwicklung, Datenanalyse, Machine Learning und Automatisierung. Python bietet eine große Auswahl an Bibliotheken, die den Entwicklungsprozess beschleunigen und erleichtern. Durch die starke Community und umfangreiche Dokumentation ist es ideal für Anfänger und Profis. Zudem ist Python plattformunabhängig, was bedeutet, dass Python-Programme auf verschiedenen Betriebssystemen laufen können.",
        "zusammenfassung": "Python ist eine vielseitige und leicht verständliche Programmiersprache, ideal für Webentwicklung, Datenanalyse und Automatisierung. Sie bietet viele Bibliotheken, läuft plattformübergreifend und eignet sich für Anfänger und Profis gleichermaßen."
    },
    {
        "begriff": "Javascript",
        "kategorie": "Entwicklung",
        "definition": "JavaScript ist eine Programmiersprache, die hauptsächlich für interaktive Elemente auf Webseiten genutzt wird. Sie läuft direkt im Browser und ermöglicht dynamische Funktionen wie Formulare, Animationen und Echtzeit-Updates. JavaScript ist zusammen mit HTML und CSS eine der zentralen Technologien für die Webentwicklung. Durch Frameworks und Bibliotheken wie React, Angular und Vue hat sich JavaScript auch für komplexere Anwendungen etabliert. Es kann außerdem auf Servern mit Node.js genutzt werden und ist so für Frontend- und Backend-Entwicklung geeignet.",
        "zusammenfassung": "JavaScript ist eine Programmiersprache, die Interaktivität auf Webseiten ermöglicht und direkt im Browser läuft. Sie ist zentral für die Webentwicklung und kann mit Tools wie Node.js auch serverseitig genutzt werden."
    },
    {
        "begriff": "SQL",
        "kategorie": "Entwicklung",
        "definition": "SQL (Structured Query Language) ist eine Sprache zur Verwaltung und Abfrage von Daten in relationalen Datenbanken. Sie ermöglicht es, Datenbanken zu erstellen, Daten zu speichern, zu aktualisieren und abzurufen. SQL ist standardisiert und wird von vielen Datenbanksystemen wie MySQL, PostgreSQL und SQLite unterstützt. Mit Befehlen wie `SELECT`, `INSERT`, `UPDATE` und `DELETE` lassen sich Daten gezielt manipulieren und analysieren. SQL wird häufig in Anwendungen genutzt, die große Datenmengen effizient verarbeiten und organisieren müssen, wie etwa in Finanz-, Web- und Unternehmensanwendungen.",
        "zusammenfassung": "SQL ist eine Sprache zur Verwaltung von Datenbanken, mit der man Daten speichern, abrufen und bearbeiten kann. Sie wird in vielen Systemen wie MySQL und PostgreSQL genutzt und ermöglicht effiziente Datenorganisation."
    }
]
